Update1C/ВыгрузкаФайловКонфигурации/InformationRegisters/ЖурналСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСобытий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Update1C/ВыгрузкаФайловКонфигурации/InformationRegisters/ЖурналСобытий/Ext/ManagerModule.bsl
// Уровень:
// 0 - Критикал
// 1 - Ошибка
// 2 - Описание
// 3 - Новый объект БД
Процедура ДобавитьЗапись(Уровень, Метод, Описание, ОбъектБД = Неопределено) Экспорт
	
	ДелатьЗаписи 			= Константы.Журнал_ВестиЛог.Получить();
	
	Если ДелатьЗаписи Тогда
		
		НоваяЗапись 			= РегистрыСведений.ЖурналСобытий.СоздатьМенеджерЗаписи();
		
		НоваяЗапись.Дата 		= ТекущаяДата();
		НоваяЗапись.ИД 			= Новый УникальныйИдентификатор;
		НоваяЗапись.Уровень 	= Уровень;
		НоваяЗапись.Метод 		= Метод;
		
		НоваяЗапись.Описание 	= Описание;
		
		Если ЗначениеЗаполнено(ОбъектБД) Тогда
			НоваяЗапись.Объект = ОбъектБД;
		КонецЕсли;
		
		НоваяЗапись.ПорядковыйНомер = ПолучитьНовыйПорядковыйНомер();
		
		НоваяЗапись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНовыйПорядковыйНомер() 
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕстьNull(МАКСИМУМ(ЖурналСобытий.ПорядковыйНомер),0) КАК ПорядковыйНомер
	|ИЗ
	|	РегистрСведений.ЖурналСобытий КАК ЖурналСобытий";
	
	ПоследнийНомер_Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПорядковыйНомер");
	
	Если ПоследнийНомер_Массив.Количество() > 0 Тогда
		
		Результат = ПоследнийНомер_Массив[0];
		
	КонецЕсли;
	
	Возврат Результат + 1;
	
КонецФункции

Процедура ОчиститьЖурналСобытий() Экспорт
	
	НоваяЗапись = РегистрыСведений.ЖурналСобытий.СоздатьНаборЗаписей();
	НоваяЗапись.Записывать = Истина;
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры
